<?php
header('content-type:text/html; charset=utf-8');
?>
<!html>

<head>
	<title>task04</title>
	<style type="text/css">
	#dds{
		color: red;
	
	}
   #kw{
      color:#000380;
      font-weight: bold;
   }
	</style>
</head>
<body>


<?php


/* Comment 
Напишете програма, която по зададени единици използвана
електроенергия и тяхната цена изчислява сметката за ток, при следните условия.
- За първите 50 единици - 0,10 лв/единица
- За следващите 100 - 0,15 лв./единица
- За следващите 100 - 0,25 лв./единица
- За следващите - 0,35 лв/единица.
- Към общата сметка се добавят 20% ДДС.
 Comment */

 $a=rand(1,500);
 $b=50;
 $c=150;
 $d=250;
 $e=500;
 $sum=$a*(0.10);
 $sum2=$sum+($a*(0.15));
 $sum3=$sum2+($a*(0.25));
 $sum4=$sum3+($a*(0.35));
 $dds=0.20+1;  // +20% ДДС към дължимата сума
 

 

 echo "Цените са:";
 echo "<p>За първите 50KW по 0,10. лв на KW.
<p>За следващите 100KW по 0,15 лв.  на KW.</p>
<p>За следващите 100KW по 0,25 лв. на KW.<p>
<p>За следващите по 0,35 лв. на KW.<p>
<p>Към общата сметка се добавят <span id='dds'>20% ДДС.</span></p>";
 echo "<p>Използвана електроенергия : <span id='kw'> $a </span> KW.</p>";


 if ($a <= $b) {            //под 50kw -  0,10лв
   echo "Дължима сума: ".
      $sum*$dds . "лв. /цената включва <span id='dds'>20% ДДС.</span>/";
   }elseif($a > $b && $a <= $c) { //по-голямо от 50kw и по-малко от 150kw - 0,15лв
   	echo "Дължима сума: ".
      $sum2*$dds . "лв. /цената включва <span id='dds'>20% ДДС.</span>/";
   }elseif($a > $c && $a <= $d) { //по-голямо от 150Kw и по-малко от 250kw - 0,25лв
   	echo "Дължима сума: ".
      $sum3*$dds . "лв. /цената включва <span id='dds'>20% ДДС.</span>/";
   }elseif($a > $d && $a <= $e ) { //по-голямо от 250kw и по-малко от 500Kw - 0,35лв
   	echo "Дължима сума: ".
      $sum4*$dds . "лв. /цената включва <span id='dds'>20% ДДС.</span>/";
   }else{
 	echo "Грешка!";
 }
 // Използвайте REFRESH( копчето F5 ) заради случайните цифри.
 

?>
</body>
</html>