<?php
/* Домашно зад. 5*.Да се направи демо-версия на онлайн магазин „е-
Мания”. Потребител влиза в системата като попълва потребителско име
и парола. След това вижда списък с продукти(поне 5) като всеки продукт
си има цена. Потребителя си избира продукт(и), въвежда номер на
дебитна/кредитна карта и налична сума пари. След това му се показва
какви продукти си е купил и колко пари са му останали налични.б) Да се
направи страница за потвържение преди покупката, която показва на
потребителя какви продукти е избрал и колко пари ще му останат и той
може да избере Потвърди или Отхвърли

Cooments*/ 
session_destroy();
header('Location:domashno_task5.php');



	
	






























?>