<?php
header('content-type:text/html; charset=utf-8');

/* Comment
Домашно зад. 5 Да се генерира двумерен масив с размери МxN и произволни стойности. Да се
намери най-малък елемент за всяка колона. И накрая да се намери сумата от най-малките елементи
за всяка колона.
*/

$n=5;
$m=5;

//двумерен масив
$arr2= array(array('12','78','55','78','700'),
	        array('10','16','36','124','5'),
	        array('36','100','300','2','1000'),
	        array('156','700','119','400','965'),
	        array('100','20','400','41','60'),
	        );

$count=count($arr2);

$min1=$arr2[0][0];//старта за сравняване за най-малко в 1ва
$min2=$arr2[1][1];//старта за сравняване за най-малко в 2ра
$min3=$arr2[2][1];//старта за сравняване за най-малко в 3та
$min4=$arr2[3][1];//старта за сравняване за най-малко в 4та
$min5=$arr2[4][1];//старта за сравняване за най-малко в 5та


echo "<p><table border='1' id='mass'>";
echo "<tr>
<td>1-ва колона</td>
<td>2-ра колона</td>
<td>3-та колона</td>
<td>4-та колона</td>
<td>5-та колона</td>
</tr>";
for ($y=0; $y < $n; $y++) { //външен

	echo "<tr>";//отваряне на редове
	for ($q=0; $q < $m; $q++) { //вътрешен
		echo "<td>".$arr2[$q][$y]."</td>";//датата в клетките

		for ($f=$y; $f < 1; $f++) { //най-малко в 1ва колона
			if ($arr2[$f][$y] < $min1) {
				$min1=$arr2[$f][$y];
			}
		}
		for ($h=1; $h < 2; $h++) { //най-малко в 2ра колона
			if ($arr2[$h][$y] < $min2) {
				$min2=$arr2[$h][$y];
			}
		}
		for ($z=2; $z < 3; $z++) { //най-малко в 3та колона
			if ($arr2[$z][$y] < $min3) {
				$min3=$arr2[$z][$y];
			}
		}
		for ($l=3; $l < 4; $l++) { //най-малко в 4та колона
			if ($arr2[$l][$y] < $min4) {
				$min4=$arr2[$l][$y];
			}
		}
		for ($r=4; $r < 5; $r++) { //най-малко в 5та колона
			if ($arr2[$r][$y] < $min5) {
				$min5=$arr2[$r][$y];
			}
		}
	  
		}

	echo "</tr>";//затваряне на редове
}

$smallestsum=$min1+$min2+$min3+$min4+$min5; //сумата 




echo "<tr>
<td>Най-малкия елемент :</td>
<td>Най-малкия елемент :</td>
<td>Най-малкия елемент :</td>
<td>Най-малкия елемент :</td>
<td>Най-малкия елемент :</td>
</tr>";


echo "<tr>";
echo "<td>$min1</td>";//най-малките стойности
echo "<td>$min2</td>";//най-малките стойности
echo "<td>$min3</td>";//най-малките стойности
echo "<td>$min4</td>";//най-малките стойности
echo "<td>$min5</td>";//най-малките стойности
echo "</tr>";
echo "<tr>";
echo "<td colspan='2'>Сумата от най-малките стойности, за всяка колона е :</td>";
echo "<td>".$min1."+".$min2."+".$min3."+".$min4."+".$min5." ="."</td>";
echo "<td colspan='2'>$smallestsum </td>";//сумата от най-малките
echo "</tr>";
echo "</table></p>";
?>


<!HTML>
 <head>
 	<meta charset="UTF-8">
 	<title>task01</title>
 	<meta charset="UTF-8">
<style type="text/css">
#mass{
      text-align: center;
  }
	
</style>
 </head>
 <body>
 </body>
 </html>



